app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Pill"], ["last_name", "Cosby"], ["created_at", "2020-09-23 16:23:51.915846"], ["updated_at", "2020-09-23 16:23:51.915846"]]
---
	def create
		@student = Student.create(params.require(:student).permit!(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def update
		@student = Student.find(params[:id])